---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailTransitionTypeParam
source: html/c0b74a90-f6bf-544a-dca9-c8fbd7a23bca.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailTransitionTypeParam Property

"Transitions"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailTransitionTypeParam { get; }
```